nxp-mcuxpresso/mcux-sdk-examples/frdmk66f/demo_apps/ftm_pdb_adc16/pin_mux.h
/*
 * Copyright 2019 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB17 (coord E9), U10[1]/UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB16 (coord E10), U7[4]/UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC1 (coord B11), J1[5]/U20[C5]/I2S_TXD
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2S_TXD_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2S_TXD_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_I2S_TXD_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC2 (coord A12), J1[14]/FTM0_CH1/CMP1_IN0/FB_AD12
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC3 (coord A11), J1[2]/UART1_RX/FTM0_CH2/CLKOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART1_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_UART1_RX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_UART1_RX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA6 (coord J7), J3[7]/CLKOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CLKOUT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_CLKOUT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_CLKOUT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA7 (coord J8), J3[9]/FTM0_CH4/TRACE_D3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FTM0_CH4_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_FTM0_CH4_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_FTM0_CH4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA2 (coord K6), J9[6]/JTAG_TDO/TRACE_SWO/EZP_DO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_TRACE_SWO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_TRACE_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_TRACE_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
